COMMON_STOP_WORDS = {
    # 汎用語
    "情報","対象","場合","状況","内容","事項",
    "関係","利用","実施","提供","対象"
}

PDF_STOP_WORDS = {
    
    "sample.pdf": {
        "当該","平成","情報","状況","金額","機構","案件","当方","お願い",
        "相手方","ウェブサイト","見直し","御理解","御協力","ご了知","当機構",
        "しま","一定","上記","所要","起算","実施","同意","関係","公開",
        "提供","該当","名称","人数","職名","区分","締結","経験",
        "事務","事業","法人","役員","公表","応募","応札","取引","協力",
        "顧問","適用","原則","割合","数量","光熱","支出","在職","独立行政法人",
        "基本方針","閣議決定","総売上","事業収入","事業年度","予定価格",
        "契約締結","最終職名","直近",
    },
    
    "ai_guideline.pdf": {
        "教員",
        "学生",
        "生成AI",
        "ガイドライン",
        "教育活動",
        "AIサービス",
    },
    
    "machine_learning.pdf": {
        "ます","する","を","に","な","します","です","非常","事","ほど"
    },
    
    "G検定紹介資料_202606.pdf": {
        "を","とは","と","により","です","いき","など","な","あります","い","しているかどうか",
        "し","なってい","される","ください","の","は","について","に","ます","では"
    },
}